app/Models/MLanding.php

    public function getMenuLanding($limit = '', $order = 'asc')
    {
        $DB = $this->db->table('menu_landing');
        $DB->where('menu_landing_parent', 0);
        $DB->orderBy('menu_landing_urutan', $order);
        if ($limit != '') $DB->limit($limit);
        $m = $DB->get()->getResultArray();
---
SELECT *
FROM `menu_landing`
WHERE `menu_landing_parent` = 0
ORDER BY `menu_landing_urutan` ASC
 LIMIT 4

    public function checkMenuParent($mpid)
    {
        return $this->db->table('menu_landing')
            ->where('menu_landing_parent', $mpid)
            ->countAllResults();
---
SELECT COUNT(*) AS `numrows`
FROM `menu_landing`
WHERE `menu_landing_parent` = '1'

    public function getMenuChild($mpid)
    {
        return $this->db->table('menu_landing')
            ->where('menu_landing_parent', $mpid)
            ->orderBy('menu_landing_urutan', 'asc')
            ->get()
            ->getResultArray();
---
SELECT *
FROM `menu_landing`
WHERE `menu_landing_parent` = '4'
ORDER BY `menu_landing_urutan` ASC