app/Models/MSidebar.php

SELECT `sidebar_id`, `sidebar_nama`, `sidebar_icon`, `sidebar_link`
FROM `sidebar`
WHERE `parent_id` = 0
AND `status` = 1
---
    public function getSidebars()
    {
        $data = $this->db->table('sidebar')
            ->select('
                sidebar_id,
                sidebar_nama,
                sidebar_icon,
                sidebar_link
            ')
            ->where('parent_id', 0)
            ->where('status', 1)
            ->get()
            ->getResult();

SELECT `sidebar_id`, `sidebar_nama`, `sidebar_icon`, `sidebar_link`
FROM `sidebar`
WHERE `parent_id` = '10'
AND `status` = 1
---
    public function getChildSidebar($parent = '')
    {
        $data = $this->db->table('sidebar')
            ->select('
                sidebar_id,
                sidebar_nama,
                sidebar_icon,
                sidebar_link
            ')
            ->where('parent_id', $parent)
            ->where('status', 1)
            ->get()
            ->getResult();