app/Models/MUsers.php

SELECT `c`.`country_nama`, `u`.`email`, `u`.`user_img`, `u`.`user_nama`, `u`.`user_tgl_lahir`, `u`.`is_active`, `c`.`country_id`, `u`.`user_id`
FROM `user` as `u`
JOIN `country` as `c` ON `c`.`country_id`=`u`.`country_id`
WHERE `u`.`user_id` = '5'
---
    public function getUserbyId($uid)
    {
        $data = $this->db->table('user as u')
            ->select('c.country_nama, u.email, u.user_img, u.user_nama, u.user_tgl_lahir, u.is_active, c.country_id , u.user_id')
            ->join('country as c', 'c.country_id=u.country_id')
            ->where('u.user_id', $uid)
            ->get()
            ->getRowArray();