app/Models/MUtils.php

    public function getCards()
    {
        $i['users'] = $this->db->table('user')
            ->where('user_level_id', 2)
            ->countAllResults();
        $i['movies'] = $this->db->table('video')
            ->countAllResults();
        $i['visitor'] = $this->db->table('statistik')
            ->selectSum('statistik_count')
            ->get()
            ->getRow();
---
SELECT COUNT(*) AS `numrows`
FROM `user`
WHERE `user_level_id` = 2
SELECT COUNT(*) AS `numrows`
FROM `video`
SELECT SUM(`statistik_count`) AS `statistik_count`
FROM `statistik`

    public function getIdentitasWeb()
    {
        return $this->db->table('identitas_web')
            ->where('identitas_web_id', 1)
            ->get()
            ->getRowArray();
---
SELECT *
FROM `identitas_web`
WHERE `identitas_web_id` = 1

    public function statistikWebsite($arr)
    {
        //Cek Apakah Sudah Ada
        $i = $this->db->table('statistik')
            ->select('statistik_count')
            ->like('created_time', explode(' ', $arr['created_time'])[0])
            ->where('statistik_ip', $arr['statistik_ip'])
            ->get()
            ->getRow();

        //Insert or Update
        if (@$i->statistik_count) {
            $this->db->table('statistik')
                ->where('statistik_ip', $arr['statistik_ip'])
                ->like('created_time', explode(' ', $arr['created_time'])[0])
                ->set(['statistik_count' => $i->statistik_count + 1, 'updated_time' => date('Y-m-d H:i:s')])
                ->update();
---
SELECT `statistik_count`
FROM `statistik`
WHERE `created_time` LIKE '%2022-04-26%' ESCAPE '!'
AND `statistik_ip` = '127.0.0.1'
UPDATE `statistik` SET `statistik_count` = 9, `updated_time` = '2022-04-26 18:56:54'
WHERE `statistik_ip` = '127.0.0.1'
AND  `created_time` LIKE '%2022-04-26%' ESCAPE '!'