app/Models/MVideos.php

SELECT *
FROM `user_favorit`
WHERE `video_id` = '7'
AND `user_id` = '5'
---
    public function checkFavorit($uid, $res)
    {
        $data = [];
        foreach ($res as $key => $value) {
            $m = $this->db->table('user_favorit')
                ->where('video_id', $value['video_id'])
                ->where('user_id', $uid)
                ->get()
                ->getRowArray();

SELECT DISTINCT `v`.`video_nama`, `hd`.`created_time`, `hd`.`history_dilihat_loop`, `v`.`video_id`
FROM `history_dilihat` as `hd`
JOIN `video` as `v` ON `v`.`video_id`=`hd`.`video_id`
JOIN `video_genre` as `vg` ON `vg`.`video_genre_id`=`v`.`video_genre_id`
WHERE `hd`.`user_id` = '5'
ORDER BY `hd`.`created_time` DESC
 LIMIT 5
---
    public function getLastView()
    {
        $uid = $this->session->get('user_id');
        $data = $this->db->table('history_dilihat as hd')
            ->distinct()
            ->select('v.video_nama, hd.created_time, hd.history_dilihat_loop, v.video_id')
            ->join('video as v', 'v.video_id=hd.video_id')
            ->join('video_genre as vg', 'vg.video_genre_id=v.video_genre_id')
            ->where('hd.user_id', $uid)
            ->orderBy('hd.created_time', 'desc')
            ->limit(5)
            ->get()
            ->getResultArray();